/***************************************************************/
/*						בדיקת תקינות ספרות בול פגיעה			*/ 						
/*--------------------------------------------------------------*/
/****************************************************************/
/*						:כיתה:            שם:             ציון	*/   
/****************************************************************/
/*																*/					
/*																*/					
/*																*/					
/*					התוכנית מציגה את כל הספרות					*/
/*					  התקניות למשחק בול פגיעה					*/
/*																*/						 										
/*																*/																									
/*																*/					
/*																*/					
/****************************************************************/

/*----------------    Pre-Processor section    ----------------*/
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <conio.h>


/*---------  Functions/Functions-Declarations section  --------*/
validation();//פונקצייה לבדיקת תוקף המספר



/*---------------------------  Main  --------------------------*/
void main()
/****************************************************************/
/*			הפונקציה תייצר את המספרים ותשלח אותם לבדיקה			*/														
/*																*/				
/****************************************************************/
{
//הכרזת משתנים 
int number,i=0;
int num1,num2,num3,num4;

for (number=123;number<9877;number++)// לולאת ייצור המספרים
			{
				num4=(number)%10;//פירוק המספר לספרות עשרוניות
				num3=(number/10)%10;
				num2=(number/100)%10;
				num1=(number/1000);
				if (validation(num1,num2,num3,num4)==1)//בדיקת תקינות המספר ע"י שליחה לפונקציה
						{
							printf("%d\n",number);
							i++;
						}	

				if (i==20)//הפסקה כל 20 שורות
					{
						getch();
						i=0;
					}	
				
			}



}


/*--------------------  Functions section  --------------------*/

validation(num1,num2,num3,num4)//הפונקציה מקבלת 4 ספרות ומחזירה ערך אמת במידה ואין כפילויות בין הספרות
{
if ((num1==num2)||(num1==num3)||(num1==num4)||(num2==num3)||(num2==num4)||(num3==num4)) 
return 0;
	else return 1;
}

/****************************    END   *************************/




