/***************************************************************/
/*				            מציאת היתר במשולש									
/*-------------------------------------------------------------*/
/*					                                
/***************************************************************/
/*						:כיתה:             שם:               ציון   
/***************************************************************/
/*																					
/*																					
/*																					
/*        	התוכנית תקלוט 2 ערכי הניצבים במשולש ותפלוט את היתר					
/*																					
/*																					
/*																					
/***************************************************************/

/*----------------    Pre-Processor section    ----------------*/
#include <stdio.h>
#include <math.h>

/*---------  Functions/Functions-Declarations section  --------*/


/*---------------------------  Main  --------------------------*/
main()
/***************************************************************/
/*																											  תאור התכולה ואופן הפעולה						*/
/*																			
/***************************************************************/
{
//הצהרה על משתנים
int side_a,side_b;

//קליטת ערכי צלעות המשולש
printf("Please enter length of the 2 sides\n");
scanf ("%d%d",&side_a,&side_b);

// חישוב האורך של היתר ע"פ פיתגורס והצגתו
printf("The length of the hypotenuse is %.3f\n",sqrt(side_a*side_a+side_b*side_b));

}





/****************************    END   *************************/




