/***************************************************************/
/*				      קליטת מספר וחישוב ערכו האסקי				*/ 						
/*--------------------------------------------------------------*/
/****************************************************************/
/*						:כיתה:            שם:             ציון	*/   
/****************************************************************/
/*																*/					
/*																*/					
/*																*/					
/*			התוכנית תקלוט רצף של 3 תוים, תפלוט את הערך          */
/*				האסקי שלהם ומספר שמורכב משלשת הספרות			*/
/*						ואת המכפלה של המספר ב-2					*/	
/*																*/																									
/*																*/					
/*																*/					
/****************************************************************/

/*----------------    Pre-Processor section    ----------------*/
#include <stdio.h>


/*---------  Functions/Functions-Declarations section  --------*/


/*---------------------------  Main  --------------------------*/
main()
/****************************************************************/
/*																*/											
/*																*/				
/****************************************************************/
{
//הצהרת משתנים
int  number1=0,number2=0,number3=0,thenumber;
char units,tens,hundreds;
//קליטת המספר
printf("Please Enter 3 digits.\n");
scanf("%c%c%c",&hundreds,&tens,&units);
//הצגת המספרים בנפרד ובערכם האסקי
printf("ASCII of %c is %d\tASCII of %c is %d\tASCII of %c is %d\n",hundreds,hundreds,tens,tens,units,units);
//הצגת המספר ביחידה אחת
//לצורך כך נפחית 48 מקוד האסקי שהוא המספר 0 לפי הקוד
//על מנת להשוות הפרשים ונקבל את המספר האמיתי
number1=(hundreds-48)*100;
number2=(tens-48)*10;
number3=units-48;
thenumber=number1+number2+number3;
//הצגת המספר בעצמו והכפולה שלו בשתיים
printf("Number is %d\t\tResult is %d\n",thenumber,thenumber*2);
}


/*--------------------  Functions section  --------------------*/



/****************************    END   *************************/




