//***************************************************************/
//*				        הפרדת ספרות שלמות משבר עשרוני			*/ 						
//*-------------------------------------------------------------*/
//*						                */         
//***************************************************************/
//*						:כיתה:            שם:             ציון	*/   
//***************************************************************/
//*																*/					
//*																*/					
//*																*/					
//* התוכנית תקלוט מחיר כשהוא מורכב משקלים ואגורות ותפלוט בנפרד	*/
//*						את השקלים ואת האגורות					*/	
//*																*/																									
//*																*/					
//*																*/					
//***************************************************************/

//*----------------    Pre-Processor section    ----------------*/
#include <stdio.h>
#include <math.h>

//*---------  Functions/Functions-Declarations section  --------*/


//*---------------------------  Main  --------------------------*/
main()
//***************************************************************/
//*																*/											 					
//*																*/				
//***************************************************************/
{
//הצהרת משתנים
double price,agorotd=0,shkalimd=0;
int shkalim=0,agorot=0;
//קליטת המחיר
printf("Please Enter the price\n");
scanf("%lf",&price);

//חישוב השקלים והאגורות
shkalim=price;
//המרות משלמים לשברים על מנת שפעולות אריתמטיות יהיו חוקיות
shkalimd=shkalim;
agorotd=(price-shkalimd)*100;

//הצגת התוצאה
printf("%d shkalim %.0lf agorot\n",shkalim,agorotd);
//ההנחה היא כמובן שיש מקסימום 99 אגורות במחיר
	
}


//*--------------------  Functions section  --------------------*/



//****************************    END   *************************/




