/***************************************************************/
/*				         החלפת אות קטנה בגדולה							
/*-------------------------------------------------------------*/
/*					                 
/***************************************************************/
/*						:כיתה:             שם:               ציון   
/***************************************************************/
/*																					
/*																					
/*																					
/*        התוכנית תקלוט אות קטנה כלשהי באנגלית ותפלוט את אותה 
//						אות כאות גדולה באנגלית					
/*																					
/*																					
/*																					
/***************************************************************/

/*----------------    Pre-Processor section    ----------------*/
#include <stdio.h>

/*---------  Functions/Functions-Declarations section  --------*/


/*---------------------------  Main  --------------------------*/
main()
/***************************************************************/
/*																											  תאור התכולה ואופן הפעולה						*/
/*																			
/***************************************************************/
{
//הצהרה על משתנים
 char letter;
//קליטת האות
printf("Enter the Letter\n");
scanf("%c",&letter);
//הצגת האות הגדולה
printf("The Capital letter is %c\n",letter-32);



}




/****************************    END   *************************/




